apache/nuttx/arch/arm/src/stm32wb/stm32wb_tim.c
  ainfo("  CR1: %04x CR2:  %04x SMCR:  %04x DIER:  %04x\n",
          stm32_getreg16(dev, STM32_TIM_CR1_OFFSET),
          stm32_getreg16(dev, STM32_TIM_CR2_OFFSET),
          stm32_getreg16(dev, STM32_TIM_SMCR_OFFSET),
          stm32_getreg16(dev, STM32_TIM_DIER_OFFSET)
        );
  ainfo("   SR: %04x EGR:  0000 CCMR1: %04x CCMR2: %04x\n",
          stm32_getreg16(dev, STM32_TIM_SR_OFFSET),
          stm32_getreg16(dev, STM32_TIM_CCMR1_OFFSET),
          stm32_getreg16(dev, STM32_TIM_CCMR2_OFFSET)
        );
  ainfo(" CCER: %04x CNT:  %04x PSC:   %04x ARR:   %04x\n",
          stm32_getreg16(dev, STM32_TIM_CCER_OFFSET),
          stm32_getreg16(dev, STM32_TIM_CNT_OFFSET),
          stm32_getreg16(dev, STM32_TIM_PSC_OFFSET),
          stm32_getreg16(dev, STM32_TIM_ARR_OFFSET)
        );
  ainfo(" CCR1: %04x CCR2: %04x CCR3:  %04x CCR4:  %04x\n",
          stm32_getreg16(dev, STM32_TIM_CCR1_OFFSET),
          stm32_getreg16(dev, STM32_TIM_CCR2_OFFSET),
          stm32_getreg16(dev, STM32_TIM_CCR3_OFFSET),
          stm32_getreg16(dev, STM32_TIM_CCR4_OFFSET)
        );

  if (priv->base == STM32_TIM1_BASE)
    {
      ainfo("  RCR: %04x BDTR: %04x DCR:   %04x DMAR:  %04x\n",
            stm32_getreg16(dev, STM32_TIM_RCR_OFFSET),
            stm32_getreg16(dev, STM32_TIM_BDTR_OFFSET),
            stm32_getreg16(dev, STM32_TIM_DCR_OFFSET),
            stm32_getreg16(dev, STM32_TIM_DMAR_OFFSET));
    }
  else
    {
      ainfo("  DCR: %04x DMAR: %04x\n",
            stm32_getreg16(dev, STM32_TIM_DCR_OFFSET),
            stm32_getreg16(dev, STM32_TIM_DMAR_OFFSET));
    }
}

/****************************************************************************
 * Name: stm32_tim_setmode
 ****************************************************************************/

static int stm32_tim_setmode(struct stm32_tim_dev_s *dev,
                               enum stm32_tim_mode_e mode)
{
  uint16_t val;

  DEBUGASSERT(dev != NULL);

  /* The modes DOWN and UPDOWN are not supported on TIM16 and TIM17. */

#if defined(CONFIG_STM32_TIM16) || defined(CONFIG_STM32_TIM17)
  if ((mode == STM32_TIM_MODE_DOWN || mode == STM32_TIM_MODE_UPDOWN))
    {
#if defined(CONFIG_STM32_TIM16)
      if (((struct stm32_tim_priv_s *)dev)->base == STM32_TIM16_BASE)
        {
          return -EINVAL;
        }
#endif

#if defined(CONFIG_STM32_TIM17)
      if (((struct stm32_tim_priv_s *)dev)->base == STM32_TIM17_BASE)
        {
          return -EINVAL;
        }
#endif
    }
#endif

  /* Decode operational modes */

  switch (mode & STM32_TIM_MODE_MASK)
    {
      case STM32_TIM_MODE_DISABLED:
        val = 0;
        break;

      case STM32_TIM_MODE_UP:
        val = GTIM_CR1_CEN | GTIM_CR1_ARPE;
        break;

#if defined(CONFIG_STM32_TIM1) || defined(CONFIG_STM32_TIM2)
      case STM32_TIM_MODE_DOWN:
        val = GTIM_CR1_CEN | GTIM_CR1_ARPE | TIM_1_2_CR1_DIR;
        break;

      case STM32_TIM_MODE_UPDOWN:
        val = GTIM_CR1_CEN | GTIM_CR1_ARPE | TIM_1_2_CR1_CMS_CNTR1;

        /* Our default:
         * Interrupts are generated on compare, when counting down
         */

        break;
#endif

      case STM32_TIM_MODE_PULSE:
        val = GTIM_CR1_CEN | GTIM_CR1_ARPE | GTIM_CR1_OPM;
        break;

      default:
        return -EINVAL;
    }

  stm32_tim_reload_counter(dev);
  stm32_putreg16(dev, STM32_TIM_CR1_OFFSET, val);

#ifdef CONFIG_STM32_TIM1
  /* Advanced registers require Main Output Enable */

  if (((struct stm32_tim_priv_s *)dev)->base == STM32_TIM1_BASE)
    {
      stm32_modifyreg16(dev, STM32_TIM_BDTR_OFFSET, 0, TIM1_BDTR_MOE);
    }
#endif

  return OK;
}

/****************************************************************************
 * Name: stm32_tim_setfreq
 ****************************************************************************/

static int stm32_tim_setfreq(struct stm32_tim_dev_s *dev, uint32_t freq)
{
  uint32_t freqin;
  int prescaler;
  uint32_t reload;
  uint32_t timclk;

  DEBUGASSERT(dev != NULL);

  /* Disable Timer? */

  if (freq == 0)
    {
      stm32_tim_disable(dev);
      return 0;
    }

  /* Get the input clock frequency for this timer.  These vary with
   * different timer clock sources, MCU-specific timer configuration, and
   * board-specific clock configuration.  The correct input clock frequency
   * must be defined in the board.h header file.
   */

  switch (((struct stm32_tim_priv_s *)dev)->base)
    {
#ifdef CONFIG_STM32_TIM1
      case STM32_TIM1_BASE:
        freqin = STM32_TIM1_CLKIN;
        break;
#endif

#ifdef CONFIG_STM32_TIM2
      case STM32_TIM2_BASE:
        freqin = STM32_TIM2_CLKIN;
        break;
#endif

#ifdef CONFIG_STM32_TIM16
      case STM32_TIM16_BASE:
        freqin = STM32_TIM16_CLKIN;
        break;
#endif

#ifdef CONFIG_STM32_TIM17
      case STM32_TIM17_BASE:
        freqin = STM32_TIM17_CLKIN;
        break;
#endif

      default:
        return -EINVAL;
    }

  /* Select a pre-scaler value for this timer using the input clock
   * frequency.
   *
   * Calculate optimal values for the timer prescaler and for the timer
   * reload register.  If freq is the desired frequency, then
   *
   *   reload = timclk / freq
   *   reload = (pclck / prescaler) / freq
   *
   * There are many solutions to do this, but the best solution will be the
   * one that has the largest reload value and the smallest prescaler value.
   * That is the solution that should give us the most accuracy in the timer
   * control.  Subject to:
   *
   *   0 <= prescaler  <= 65536
   *   1 <= reload <= 65535
   *
   * So ( prescaler = pclck / 65535 / freq ) would be optimal.
   */

  prescaler = (freqin / freq + 65534) / 65535;

  /* We need to decrement value for '1', but only if that will not to
   * cause underflow.
   */

  if (prescaler < 1)
    {
      awarn("WARNING: Prescaler underflowed.\n");
      prescaler = 1;
    }

  /* Check for overflow as well. */

  if (prescaler > 65536)
    {
      awarn("WARNING: Prescaler overflowed.\n");
      prescaler = 65536;
    }

  timclk = freqin / prescaler;

  reload = timclk / freq;
  if (reload < 1)
    {
      awarn("WARNING: Reload value underflowed.\n");
      reload = 1;
    }
  else if (reload > 65535)
    {
      awarn("WARNING: Reload value overflowed.\n");
      reload = 65535;
    }

  /* Set the reload and prescaler values */

  stm32_putreg16(dev, STM32_TIM_PSC_OFFSET, prescaler - 1);
  stm32_putreg16(dev, STM32_TIM_ARR_OFFSET, reload);

  return (timclk / reload);
}

/****************************************************************************
 * Name: stm32_tim_setclock
 ****************************************************************************/

static int stm32_tim_setclock(struct stm32_tim_dev_s *dev, uint32_t freq)
{
  uint32_t freqin;
  int prescaler;

  DEBUGASSERT(dev != NULL);

  /* Disable Timer? */

  if (freq == 0)
    {
      stm32_tim_disable(dev);
      return 0;
    }

  /* Get the input clock frequency for this timer.  These vary with
   * different timer clock sources, MCU-specific timer configuration, and
   * board-specific clock configuration.  The correct input clock frequency
   * must be defined in the board.h header file.
   */

  switch (((struct stm32_tim_priv_s *)dev)->base)
    {
#ifdef CONFIG_STM32_TIM1
      case STM32_TIM1_BASE:
        freqin = STM32_TIM1_CLKIN;
        break;
#endif

#ifdef CONFIG_STM32_TIM2
      case STM32_TIM2_BASE:
        freqin = STM32_TIM2_CLKIN;
        break;
#endif

#ifdef CONFIG_STM32_TIM16
      case STM32_TIM16_BASE:
        freqin = STM32_TIM16_CLKIN;
        break;
#endif

